import AppBar from '../../components/AppBar/AppBar';
import Container from '../../components/Container';



import styles from './ProfessorWinsPage.module.css';

import img1 from '../../imgs/profWins/prof-wins-01.jpg';
import img2 from '../../imgs/profWins/prof-wins-02.jpg';
import img3 from '../../imgs/profWins/prof-wins-03.jpg';
import img4 from '../../imgs/profWins/prof-wins-04.jpg';
import img5 from '../../imgs/profWins/prof-wins-05.jpg';
import img6 from '../../imgs/profWins/prof-wins-06.jpg';


const ProfessorsWinsPage = () => (
  <>
   <AppBar name="Успіхи викладачів"/>
   <Container>
   <section className={styles.section}>
     <div className={styles.imgWrapper}>
       <img src={img1} alt="girl"/>
       <p className={styles.description}>
         Протягом осіннього семестру 2021-2022 н.р керівниця бакалаврської програми 
         “ІТ та бізнес-аналітика” Юлія Клебан перебуває на дослідницькому стажуванні
         в США, м.Бостон за  за програмою Fulbright Ukraine Research and development 
         program. Стажування відбувається на базі Бізнес-школи Університету, де 
         зосереджені основні програми Business Analytics та Data Science, які є у 
         фокусі професійних інтересів Юлії. Впродовж 6 місяців Юлія працює над темою 
         застосування Project-Based Learning підходу до навчання та викладання для 
         STEAM освітніх програм.
       </p>
     </div>
 
     <div className={styles.imgWrapper}>
       <img src={img2} alt="man"/>
       <p className={styles.description}>
         26 червня під час випускних урочистостей УКУ ректор о. Богдан Прах вручив 
         чотирьом викладачам ректорську премію за виняткові досягнення у науковій 
         праці. Серед лауреатів був також Олесь Добосевич, який отримав свою 
         нагороду за розбудову та наукові успіхи Лабораторії машинного навчання 
         УКУ(MLLab). 
         «У 2018 році ми з колегами стартували Лабораторію машинного навчання УКУ, 
         яка є місцем для розвитку наукового потенціалу Факультету прикладних наук.
         Тут ми продовжуємо працювати над науковими розробками, які зокрема 
         стосуються того як передбачити інфаркт, оцифрування кирилиці, каталогізації 
         старих світлин. Крім того, наш дослідницький центр має налагоджені зв’язки 
         з індустрією та науковими колами. Тому ректорську премію приймаю як нагороду,
         котра для мене є свідченням перших результатів цієї лабораторії і 
         підтвердженням того, що робота, яку ми там проводимо, є важливою» - коментує 
         свою нагороду Олесь Добосевич.
       </p>
     </div>
 
     <a href="https://ucu.edu.ua/news/vykladachi-roku-uku-2020-vrazhennya-ta-porady-vid-trijtsi-peremozhtsiv/" className={styles.imgWrapper}>
       <img src={img3} alt="man"/>
       <p className={styles.description}>
         У 2020 році Ростислав Гринів, професор кафедри прикладної математики та 
         статистики УКУ отримав відзнаку “Викладач року” від нашого Університету. 
         Кандидатів на відзнаку можуть висувати представники спільноти університету: 
         викладачі, працівники, студенти, аспіранти та випускники. Така нагорода є 
         доброю нагодою подякувати викладачам за їхню майстерну, натхненну, 
         систематичну і багатопланову роботу зі студентами як в аудиторії, так поза 
         нею. Цією відзнакою академічна спільнота та студентство УКУ наголошують на 
         важливості належної оцінки якісного викладання в університеті та поширенні 
         успішних викладацьких практик. 
       </p>
     </a>
 
     <a href="https://ucu.edu.ua/news/yaroslav-prytula-nasha-formula-uspihu-zlagodzhena-robota-komandy-motyvovani-studenty-ta-rozvytok-naukovogo-vektoru-fakultetu/?fbclid=IwAR2gK9RBHKUMEEuWxWLnIrv-QHGhQq_3i3zMg89zSumATHGVTLGyneg6p7A" className={styles.imgWrapper}>
       <img src={img4} alt="man"/>
       <p className={styles.description}>
         У травні 2021 р. Вчена рада УКУ шляхом таємного голосування підтримала 
         продовження контракту на наступне 5-річчя декана Факультету прикладних 
         наук Ярослава Притули. Коментуючи свою попередню каденцію, Ярослав Притула 
         наголосив на трьох головних здобутках факультету за минулі п’ять років. 
         Перше - це формування професійної, дієвої та дружньої команди факультету. 
         Друге -  наші студенти та випускники, які головним чином формують порядок 
         денний розвитку факультету на наступні десятиліття. І третє - наша наукова 
         робота у Лабораторії машинного навчання, яка є носієм знань та вмінь, які 
         знаходяться на вістрі науки та сучасних технологічних розробок.
         Окрім цього, вже у вересні цього року Ярослав Притула був переобраний до 
         Сенату УКУ - колегіального органу управління та контролю Університету, який
         визначає основні засади і напрями його розвитку та приймає рішення з 
         найважливіших питань його діяльності.
       </p>
     </a>
 
     <div className={styles.imgWrapper}>
       <img src={img5} alt="man"/>
       <p className={styles.description}>
         А вже у 2021 році викладацькі стипендії від родини Любінців та від 
         Тараса Кицмея отримали Олесь Добосевич, заступник декана факультету 
         прикладних наук УКУ і Тарас Фірман, викладач курсів “Машинне навчання” 
         і “Прогнозування та досілдження операцій”. Ярослав Любінець є 
         співзасновником та головою ради директорів компанії SoftServe, разом 
         із дружиною багато років підтримують наш університет. Тарас Кицмей - 
         співвласник і член ради директорів компанії SoftServe.
      </p>
     </div>
 
     <div className={styles.imgWrapper}>
       <img src={img6} alt="man"/>
       <p className={styles.description}>
         Програма викладацьких стипендій в УКУ діє завдяки підтримці жертводавців, 
         які всіляко сприяють не лише забезпеченню гідної заробітної плати найкращим
         викладачам, а й надають додаткові ресурси для їхнього професійного розвитку. 
         У 2020 році такі стипендію від родини Любінців отримав <a href="https://www.youtube.com/watch?v=L0Rw7dU6k6o&ab_channel=%D0%A3%D0%BA%D1%80%D0%B0%D1%97%D0%BD%D1%81%D1%8C%D0%BA%D0%B8%D0%B9%D0%9A%D0%B0%D1%82%D0%BE%D0%BB%D0%B8%D1%86%D1%8C%D0%BA%D0%B8%D0%B9%D0%A3%D0%BD%D1%96%D0%B2%D0%B5%D1%80%D1%81%D0%B8%D1%82%D0%B5%D1%82">
         Степан Фединяк</a>, заступник дакана факультету прикладних наук. Стипендію від 
         Тараса Кицмея отримав <a href="https://www.youtube.com/watch?v=ydnlhv5gCdQ&t=29s&ab_channel=%D0%A3%D0%BA%D1%80%D0%B0%D1%97%D0%BD%D1%81%D1%8C%D0%BA%D0%B8%D0%B9%D0%9A%D0%B0%D1%82%D0%BE%D0%BB%D0%B8%D1%86%D1%8C%D0%BA%D0%B8%D0%B9%D0%A3%D0%BD%D1%96%D0%B2%D0%B5%D1%80%D1%81%D0%B8%D1%82%D0%B5%D1%82">Андрій Романюк</a> , доцент кафедри комп'ютерних наук 
         та інформаційних технологій УКУ.
      </p>
     </div>
 
 </section>
   </Container>
  </>
 )
 
 export default ProfessorsWinsPage;